MohammadAlmarri90/Ps2-Controller-PIC18F/Firmware/Ps2CONT.X/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.7
        Device            :  PIC18F25K42
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.31 and above
        MPLAB 	          :  MPLAB X 5.45	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set RX aliases
#define RX_TRIS                 TRISAbits.TRISA0
#define RX_LAT                  LATAbits.LATA0
#define RX_PORT                 PORTAbits.RA0
#define RX_WPU                  WPUAbits.WPUA0
#define RX_OD                   ODCONAbits.ODCA0
#define RX_ANS                  ANSELAbits.ANSELA0
#define RX_SetHigh()            do { LATAbits.LATA0 = 1; } while(0)
#define RX_SetLow()             do { LATAbits.LATA0 = 0; } while(0)
#define RX_Toggle()             do { LATAbits.LATA0 = ~LATAbits.LATA0; } while(0)
#define RX_GetValue()           PORTAbits.RA0
#define RX_SetDigitalInput()    do { TRISAbits.TRISA0 = 1; } while(0)
#define RX_SetDigitalOutput()   do { TRISAbits.TRISA0 = 0; } while(0)
#define RX_SetPullup()          do { WPUAbits.WPUA0 = 1; } while(0)
#define RX_ResetPullup()        do { WPUAbits.WPUA0 = 0; } while(0)
#define RX_SetPushPull()        do { ODCONAbits.ODCA0 = 0; } while(0)
#define RX_SetOpenDrain()       do { ODCONAbits.ODCA0 = 1; } while(0)
#define RX_SetAnalogMode()      do { ANSELAbits.ANSELA0 = 1; } while(0)
#define RX_SetDigitalMode()     do { ANSELAbits.ANSELA0 = 0; } while(0)

// get/set RY aliases
#define RY_TRIS                 TRISAbits.TRISA1
#define RY_LAT                  LATAbits.LATA1
#define RY_PORT                 PORTAbits.RA1
#define RY_WPU                  WPUAbits.WPUA1
#define RY_OD                   ODCONAbits.ODCA1
#define RY_ANS                  ANSELAbits.ANSELA1
#define RY_SetHigh()            do { LATAbits.LATA1 = 1; } while(0)
#define RY_SetLow()             do { LATAbits.LATA1 = 0; } while(0)
#define RY_Toggle()             do { LATAbits.LATA1 = ~LATAbits.LATA1; } while(0)
#define RY_GetValue()           PORTAbits.RA1
#define RY_SetDigitalInput()    do { TRISAbits.TRISA1 = 1; } while(0)
#define RY_SetDigitalOutput()   do { TRISAbits.TRISA1 = 0; } while(0)
#define RY_SetPullup()          do { WPUAbits.WPUA1 = 1; } while(0)
#define RY_ResetPullup()        do { WPUAbits.WPUA1 = 0; } while(0)
#define RY_SetPushPull()        do { ODCONAbits.ODCA1 = 0; } while(0)
#define RY_SetOpenDrain()       do { ODCONAbits.ODCA1 = 1; } while(0)
#define RY_SetAnalogMode()      do { ANSELAbits.ANSELA1 = 1; } while(0)
#define RY_SetDigitalMode()     do { ANSELAbits.ANSELA1 = 0; } while(0)

// get/set LX aliases
#define LX_TRIS                 TRISAbits.TRISA2
#define LX_LAT                  LATAbits.LATA2
#define LX_PORT                 PORTAbits.RA2
#define LX_WPU                  WPUAbits.WPUA2
#define LX_OD                   ODCONAbits.ODCA2
#define LX_ANS                  ANSELAbits.ANSELA2
#define LX_SetHigh()            do { LATAbits.LATA2 = 1; } while(0)
#define LX_SetLow()             do { LATAbits.LATA2 = 0; } while(0)
#define LX_Toggle()             do { LATAbits.LATA2 = ~LATAbits.LATA2; } while(0)
#define LX_GetValue()           PORTAbits.RA2
#define LX_SetDigitalInput()    do { TRISAbits.TRISA2 = 1; } while(0)
#define LX_SetDigitalOutput()   do { TRISAbits.TRISA2 = 0; } while(0)
#define LX_SetPullup()          do { WPUAbits.WPUA2 = 1; } while(0)
#define LX_ResetPullup()        do { WPUAbits.WPUA2 = 0; } while(0)
#define LX_SetPushPull()        do { ODCONAbits.ODCA2 = 0; } while(0)
#define LX_SetOpenDrain()       do { ODCONAbits.ODCA2 = 1; } while(0)
#define LX_SetAnalogMode()      do { ANSELAbits.ANSELA2 = 1; } while(0)
#define LX_SetDigitalMode()     do { ANSELAbits.ANSELA2 = 0; } while(0)

// get/set LY aliases
#define LY_TRIS                 TRISAbits.TRISA3
#define LY_LAT                  LATAbits.LATA3
#define LY_PORT                 PORTAbits.RA3
#define LY_WPU                  WPUAbits.WPUA3
#define LY_OD                   ODCONAbits.ODCA3
#define LY_ANS                  ANSELAbits.ANSELA3
#define LY_SetHigh()            do { LATAbits.LATA3 = 1; } while(0)
#define LY_SetLow()             do { LATAbits.LATA3 = 0; } while(0)
#define LY_Toggle()             do { LATAbits.LATA3 = ~LATAbits.LATA3; } while(0)
#define LY_GetValue()           PORTAbits.RA3
#define LY_SetDigitalInput()    do { TRISAbits.TRISA3 = 1; } while(0)
#define LY_SetDigitalOutput()   do { TRISAbits.TRISA3 = 0; } while(0)
#define LY_SetPullup()          do { WPUAbits.WPUA3 = 1; } while(0)
#define LY_ResetPullup()        do { WPUAbits.WPUA3 = 0; } while(0)
#define LY_SetPushPull()        do { ODCONAbits.ODCA3 = 0; } while(0)
#define LY_SetOpenDrain()       do { ODCONAbits.ODCA3 = 1; } while(0)
#define LY_SetAnalogMode()      do { ANSELAbits.ANSELA3 = 1; } while(0)
#define LY_SetDigitalMode()     do { ANSELAbits.ANSELA3 = 0; } while(0)

// get/set ACK aliases
#define ACK_TRIS                 TRISAbits.TRISA4
#define ACK_LAT                  LATAbits.LATA4
#define ACK_PORT                 PORTAbits.RA4
#define ACK_WPU                  WPUAbits.WPUA4
#define ACK_OD                   ODCONAbits.ODCA4
#define ACK_ANS                  ANSELAbits.ANSELA4
#define ACK_SetHigh()            do { LATAbits.LATA4 = 1; } while(0)
#define ACK_SetLow()             do { LATAbits.LATA4 = 0; } while(0)
#define ACK_Toggle()             do { LATAbits.LATA4 = ~LATAbits.LATA4; } while(0)
#define ACK_GetValue()           PORTAbits.RA4
#define ACK_SetDigitalInput()    do { TRISAbits.TRISA4 = 1; } while(0)
#define ACK_SetDigitalOutput()   do { TRISAbits.TRISA4 = 0; } while(0)
#define ACK_SetPullup()          do { WPUAbits.WPUA4 = 1; } while(0)
#define ACK_ResetPullup()        do { WPUAbits.WPUA4 = 0; } while(0)
#define ACK_SetPushPull()        do { ODCONAbits.ODCA4 = 0; } while(0)
#define ACK_SetOpenDrain()       do { ODCONAbits.ODCA4 = 1; } while(0)
#define ACK_SetAnalogMode()      do { ANSELAbits.ANSELA4 = 1; } while(0)
#define ACK_SetDigitalMode()     do { ANSELAbits.ANSELA4 = 0; } while(0)

// get/set RA5 procedures
#define RA5_SetHigh()            do { LATAbits.LATA5 = 1; } while(0)
#define RA5_SetLow()             do { LATAbits.LATA5 = 0; } while(0)
#define RA5_Toggle()             do { LATAbits.LATA5 = ~LATAbits.LATA5; } while(0)
#define RA5_GetValue()              PORTAbits.RA5
#define RA5_SetDigitalInput()    do { TRISAbits.TRISA5 = 1; } while(0)
#define RA5_SetDigitalOutput()   do { TRISAbits.TRISA5 = 0; } while(0)
#define RA5_SetPullup()             do { WPUAbits.WPUA5 = 1; } while(0)
#define RA5_ResetPullup()           do { WPUAbits.WPUA5 = 0; } while(0)
#define RA5_SetAnalogMode()         do { ANSELAbits.ANSELA5 = 1; } while(0)
#define RA5_SetDigitalMode()        do { ANSELAbits.ANSELA5 = 0; } while(0)

// get/set R2 aliases
#define R2_TRIS                 TRISAbits.TRISA6
#define R2_LAT                  LATAbits.LATA6
#define R2_PORT                 PORTAbits.RA6
#define R2_WPU                  WPUAbits.WPUA6
#define R2_OD                   ODCONAbits.ODCA6
#define R2_ANS                  ANSELAbits.ANSELA6
#define R2_SetHigh()            do { LATAbits.LATA6 = 1; } while(0)
#define R2_SetLow()             do { LATAbits.LATA6 = 0; } while(0)
#define R2_Toggle()             do { LATAbits.LATA6 = ~LATAbits.LATA6; } while(0)
#define R2_GetValue()           PORTAbits.RA6
#define R2_SetDigitalInput()    do { TRISAbits.TRISA6 = 1; } while(0)
#define R2_SetDigitalOutput()   do { TRISAbits.TRISA6 = 0; } while(0)
#define R2_SetPullup()          do { WPUAbits.WPUA6 = 1; } while(0)
#define R2_ResetPullup()        do { WPUAbits.WPUA6 = 0; } while(0)
#define R2_SetPushPull()        do { ODCONAbits.ODCA6 = 0; } while(0)
#define R2_SetOpenDrain()       do { ODCONAbits.ODCA6 = 1; } while(0)
#define R2_SetAnalogMode()      do { ANSELAbits.ANSELA6 = 1; } while(0)
#define R2_SetDigitalMode()     do { ANSELAbits.ANSELA6 = 0; } while(0)

