MohammadAlmarri90/Ps2-Controller-PIC18F/Firmware/Ps2CONT.X/mcc_generated_files/pin_manager.h
// get/set L2 aliases
#define L2_TRIS                 TRISAbits.TRISA7
#define L2_LAT                  LATAbits.LATA7
#define L2_PORT                 PORTAbits.RA7
#define L2_WPU                  WPUAbits.WPUA7
#define L2_OD                   ODCONAbits.ODCA7
#define L2_ANS                  ANSELAbits.ANSELA7
#define L2_SetHigh()            do { LATAbits.LATA7 = 1; } while(0)
#define L2_SetLow()             do { LATAbits.LATA7 = 0; } while(0)
#define L2_Toggle()             do { LATAbits.LATA7 = ~LATAbits.LATA7; } while(0)
#define L2_GetValue()           PORTAbits.RA7
#define L2_SetDigitalInput()    do { TRISAbits.TRISA7 = 1; } while(0)
#define L2_SetDigitalOutput()   do { TRISAbits.TRISA7 = 0; } while(0)
#define L2_SetPullup()          do { WPUAbits.WPUA7 = 1; } while(0)
#define L2_ResetPullup()        do { WPUAbits.WPUA7 = 0; } while(0)
#define L2_SetPushPull()        do { ODCONAbits.ODCA7 = 0; } while(0)
#define L2_SetOpenDrain()       do { ODCONAbits.ODCA7 = 1; } while(0)
#define L2_SetAnalogMode()      do { ANSELAbits.ANSELA7 = 1; } while(0)
#define L2_SetDigitalMode()     do { ANSELAbits.ANSELA7 = 0; } while(0)

// get/set DOWN aliases
#define DOWN_TRIS                 TRISBbits.TRISB0
#define DOWN_LAT                  LATBbits.LATB0
#define DOWN_PORT                 PORTBbits.RB0
#define DOWN_WPU                  WPUBbits.WPUB0
#define DOWN_OD                   ODCONBbits.ODCB0
#define DOWN_ANS                  ANSELBbits.ANSELB0
#define DOWN_SetHigh()            do { LATBbits.LATB0 = 1; } while(0)
#define DOWN_SetLow()             do { LATBbits.LATB0 = 0; } while(0)
#define DOWN_Toggle()             do { LATBbits.LATB0 = ~LATBbits.LATB0; } while(0)
#define DOWN_GetValue()           PORTBbits.RB0
#define DOWN_SetDigitalInput()    do { TRISBbits.TRISB0 = 1; } while(0)
#define DOWN_SetDigitalOutput()   do { TRISBbits.TRISB0 = 0; } while(0)
#define DOWN_SetPullup()          do { WPUBbits.WPUB0 = 1; } while(0)
#define DOWN_ResetPullup()        do { WPUBbits.WPUB0 = 0; } while(0)
#define DOWN_SetPushPull()        do { ODCONBbits.ODCB0 = 0; } while(0)
#define DOWN_SetOpenDrain()       do { ODCONBbits.ODCB0 = 1; } while(0)
#define DOWN_SetAnalogMode()      do { ANSELBbits.ANSELB0 = 1; } while(0)
#define DOWN_SetDigitalMode()     do { ANSELBbits.ANSELB0 = 0; } while(0)

// get/set LEFT aliases
#define LEFT_TRIS                 TRISBbits.TRISB1
#define LEFT_LAT                  LATBbits.LATB1
#define LEFT_PORT                 PORTBbits.RB1
#define LEFT_WPU                  WPUBbits.WPUB1
#define LEFT_OD                   ODCONBbits.ODCB1
#define LEFT_ANS                  ANSELBbits.ANSELB1
#define LEFT_SetHigh()            do { LATBbits.LATB1 = 1; } while(0)
#define LEFT_SetLow()             do { LATBbits.LATB1 = 0; } while(0)
#define LEFT_Toggle()             do { LATBbits.LATB1 = ~LATBbits.LATB1; } while(0)
#define LEFT_GetValue()           PORTBbits.RB1
#define LEFT_SetDigitalInput()    do { TRISBbits.TRISB1 = 1; } while(0)
#define LEFT_SetDigitalOutput()   do { TRISBbits.TRISB1 = 0; } while(0)
#define LEFT_SetPullup()          do { WPUBbits.WPUB1 = 1; } while(0)
#define LEFT_ResetPullup()        do { WPUBbits.WPUB1 = 0; } while(0)
#define LEFT_SetPushPull()        do { ODCONBbits.ODCB1 = 0; } while(0)
#define LEFT_SetOpenDrain()       do { ODCONBbits.ODCB1 = 1; } while(0)
#define LEFT_SetAnalogMode()      do { ANSELBbits.ANSELB1 = 1; } while(0)
#define LEFT_SetDigitalMode()     do { ANSELBbits.ANSELB1 = 0; } while(0)

// get/set RIGHT aliases
#define RIGHT_TRIS                 TRISBbits.TRISB2
#define RIGHT_LAT                  LATBbits.LATB2
#define RIGHT_PORT                 PORTBbits.RB2
#define RIGHT_WPU                  WPUBbits.WPUB2
#define RIGHT_OD                   ODCONBbits.ODCB2
#define RIGHT_ANS                  ANSELBbits.ANSELB2
#define RIGHT_SetHigh()            do { LATBbits.LATB2 = 1; } while(0)
#define RIGHT_SetLow()             do { LATBbits.LATB2 = 0; } while(0)
#define RIGHT_Toggle()             do { LATBbits.LATB2 = ~LATBbits.LATB2; } while(0)
#define RIGHT_GetValue()           PORTBbits.RB2
#define RIGHT_SetDigitalInput()    do { TRISBbits.TRISB2 = 1; } while(0)
#define RIGHT_SetDigitalOutput()   do { TRISBbits.TRISB2 = 0; } while(0)
#define RIGHT_SetPullup()          do { WPUBbits.WPUB2 = 1; } while(0)
#define RIGHT_ResetPullup()        do { WPUBbits.WPUB2 = 0; } while(0)
#define RIGHT_SetPushPull()        do { ODCONBbits.ODCB2 = 0; } while(0)
#define RIGHT_SetOpenDrain()       do { ODCONBbits.ODCB2 = 1; } while(0)
#define RIGHT_SetAnalogMode()      do { ANSELBbits.ANSELB2 = 1; } while(0)
#define RIGHT_SetDigitalMode()     do { ANSELBbits.ANSELB2 = 0; } while(0)

// get/set UP aliases
#define UP_TRIS                 TRISBbits.TRISB3
#define UP_LAT                  LATBbits.LATB3
#define UP_PORT                 PORTBbits.RB3
#define UP_WPU                  WPUBbits.WPUB3
#define UP_OD                   ODCONBbits.ODCB3
#define UP_ANS                  ANSELBbits.ANSELB3
#define UP_SetHigh()            do { LATBbits.LATB3 = 1; } while(0)
#define UP_SetLow()             do { LATBbits.LATB3 = 0; } while(0)
#define UP_Toggle()             do { LATBbits.LATB3 = ~LATBbits.LATB3; } while(0)
#define UP_GetValue()           PORTBbits.RB3
#define UP_SetDigitalInput()    do { TRISBbits.TRISB3 = 1; } while(0)
#define UP_SetDigitalOutput()   do { TRISBbits.TRISB3 = 0; } while(0)
#define UP_SetPullup()          do { WPUBbits.WPUB3 = 1; } while(0)
#define UP_ResetPullup()        do { WPUBbits.WPUB3 = 0; } while(0)
#define UP_SetPushPull()        do { ODCONBbits.ODCB3 = 0; } while(0)
#define UP_SetOpenDrain()       do { ODCONBbits.ODCB3 = 1; } while(0)
#define UP_SetAnalogMode()      do { ANSELBbits.ANSELB3 = 1; } while(0)
#define UP_SetDigitalMode()     do { ANSELBbits.ANSELB3 = 0; } while(0)

// get/set TRIANGLE aliases
#define TRIANGLE_TRIS                 TRISBbits.TRISB4
#define TRIANGLE_LAT                  LATBbits.LATB4
#define TRIANGLE_PORT                 PORTBbits.RB4
#define TRIANGLE_WPU                  WPUBbits.WPUB4
#define TRIANGLE_OD                   ODCONBbits.ODCB4
#define TRIANGLE_ANS                  ANSELBbits.ANSELB4
#define TRIANGLE_SetHigh()            do { LATBbits.LATB4 = 1; } while(0)
#define TRIANGLE_SetLow()             do { LATBbits.LATB4 = 0; } while(0)
#define TRIANGLE_Toggle()             do { LATBbits.LATB4 = ~LATBbits.LATB4; } while(0)
#define TRIANGLE_GetValue()           PORTBbits.RB4
#define TRIANGLE_SetDigitalInput()    do { TRISBbits.TRISB4 = 1; } while(0)
#define TRIANGLE_SetDigitalOutput()   do { TRISBbits.TRISB4 = 0; } while(0)
#define TRIANGLE_SetPullup()          do { WPUBbits.WPUB4 = 1; } while(0)
#define TRIANGLE_ResetPullup()        do { WPUBbits.WPUB4 = 0; } while(0)
#define TRIANGLE_SetPushPull()        do { ODCONBbits.ODCB4 = 0; } while(0)
#define TRIANGLE_SetOpenDrain()       do { ODCONBbits.ODCB4 = 1; } while(0)
#define TRIANGLE_SetAnalogMode()      do { ANSELBbits.ANSELB4 = 1; } while(0)
#define TRIANGLE_SetDigitalMode()     do { ANSELBbits.ANSELB4 = 0; } while(0)

// get/set SQUARE aliases
#define SQUARE_TRIS                 TRISBbits.TRISB5
#define SQUARE_LAT                  LATBbits.LATB5
#define SQUARE_PORT                 PORTBbits.RB5
#define SQUARE_WPU                  WPUBbits.WPUB5
#define SQUARE_OD                   ODCONBbits.ODCB5
#define SQUARE_ANS                  ANSELBbits.ANSELB5
#define SQUARE_SetHigh()            do { LATBbits.LATB5 = 1; } while(0)
#define SQUARE_SetLow()             do { LATBbits.LATB5 = 0; } while(0)
#define SQUARE_Toggle()             do { LATBbits.LATB5 = ~LATBbits.LATB5; } while(0)
#define SQUARE_GetValue()           PORTBbits.RB5
#define SQUARE_SetDigitalInput()    do { TRISBbits.TRISB5 = 1; } while(0)
#define SQUARE_SetDigitalOutput()   do { TRISBbits.TRISB5 = 0; } while(0)
#define SQUARE_SetPullup()          do { WPUBbits.WPUB5 = 1; } while(0)
#define SQUARE_ResetPullup()        do { WPUBbits.WPUB5 = 0; } while(0)
#define SQUARE_SetPushPull()        do { ODCONBbits.ODCB5 = 0; } while(0)
#define SQUARE_SetOpenDrain()       do { ODCONBbits.ODCB5 = 1; } while(0)
#define SQUARE_SetAnalogMode()      do { ANSELBbits.ANSELB5 = 1; } while(0)
#define SQUARE_SetDigitalMode()     do { ANSELBbits.ANSELB5 = 0; } while(0)

